#!/bin/bash

# 设置终端字符编码为 UTF-8
export LANG=en_US.UTF-8

# 清屏
clear

echo ""
echo "============================================================================"
echo "                               应用启动脚本"
echo "============================================================================"
echo ""
cat ./ASCII.txt
echo ""
echo ""

# 进入脚本所在目录
cd "$(dirname "$0")"

echo ""
echo "正在启动应用，请稍候..."

# 启动应用
npm start &
echo ""
node check-service.mjs
echo ""
echo "提示：请按住 Ctrl 键并点击以上链接以在浏览器中打开。"
echo ""
echo "============================================================================"
echo ""

# 暂停，等待用户按任意键
read -n 1 -s -r -p "按 Ctrl + C 退出应用..."
echo ""
